//**********************************************堆排序********************************************************//
//**************************************************************************************************************//

void adjustDown(int* a, int root, int size)
{
	int parent = root;
	int child = parent * 2 + 1;

	while (child < size)
	{
		if (child + 1 < size && a[child + 1] > a[child])
		{
			++child;
		}
		if (a[parent] < a[child])
		{
			swap(a[parent], a[child]);
			parent = child;
			child = parent * 2 + 1;
		}
		else
		{
			break;
		}
	}
}

void HeapSort(int* a, int size)
{
	//重要的事情说三遍，这里的i是>=0的. 是>=0的！！！  0的时候也需要向下调整的！

	for (int i = ((size - 2)>>1); i >= 0; i--)
	{
		adjustDown(a, i, size);
	}

	int end = size - 1;

	while (end)
	{
		swap(a[0], a[end]);

		--end;

		adjustDown(a, 0, end);
		
	}
}
//***************************************************************************************************************//
//**************************************************************************************************************//